Revit 2027 API
AnalysisDisplayVectorSettings(AnalysisDisplayVectorSettings) Constructor
 Constructs a new copy of the input AnalysisDisplayVectorSettings object.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayVectorSettings(
	AnalysisDisplayVectorSettings other
)
Public Sub New (
	other As AnalysisDisplayVectorSettings
)
public:
AnalysisDisplayVectorSettings(
	AnalysisDisplayVectorSettings^ other
)
new :
        other : AnalysisDisplayVectorSettings -> AnalysisDisplayVectorSettings
Parameters
other AnalysisDisplayVectorSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalysisDisplayVectorSettings Class
AnalysisDisplayVectorSettings Overload
Autodesk.Revit.DB.Analysis Namespace